notes/meeting_2022oct23.org
* meeting notes October 23, 2022
** the raku study group
**** usual links
***** these notes
****** https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022oct23.md
***** code examples
****** https://github.com/doomvox/raku-study/tree/main/bin/2022oct23
***** last meeting notes
****** https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022oct09.md


** topics

*** the modgrid/eurorack problem 
**** https://www.modulargrid.net/e/modules/evaluationlists
**** q: doing popularity stats and such
**** william michels soultion
#+BEGIN_SRC sh
perl6 -e 'my @a = lines.antipairs; my @b = @a.sort(*.keys.words[0..*-3]).rotor(2 => -1); my @c; do for @b -> $b { @c.push($b) if $b.
[0].keys.words[0..*-4] eq $b.[1].keys.words[0..*-4] }; say ($_ => (.[0].value - 100) + .[1].value).antipairs for @c.sort( { (.[0].value
- 100) + .[1].value});'
#+END_SRC

***** https://github.com/doomvox/raku-study/tree/main/bin/oct09/modgrid_popularity_william_michels.raku
***** /home/doom/End/Cave/RakuStudy/Wall/raku-study/bin/2022oct09/modgrid_popularity_william_michels.raku

**** bruce gray 
***** https://github.com/doomvox/raku-study/tree/main/bin/oct09/modgrid
***** /home/doom/End/Cave/RakuStudy/Wall/raku-study/bin/2022oct09/modgrid

**** my thought:
***** convert to tsv: flip-split-join-flip
****** reverse the lines, split on whitespace (up to a limit), join on tabs, reverse again

*** classify
**** https://docs.raku.org/routine/classify

*** lizmat on smartmatch asymmetry 
**** https://dev.to/lizmat/dont-fear-the-grepper-2-4ki5

*** Rob's issue with ,= and nested Hashes
**** https://github.com/rakudo/rakudo/issues/4945

**** detecting containers: https://stackoverflow.com/questions/68734064/is-there-a-way-to-detect-whether-something-is-immutable

*** weekly challenge
**** https://theweeklychallenge.org/

*** using a pull request to add notes here is an excellent thing to do
**** but the *.md files are automatically generated from the *.org source.
**** Q: Any better policy? Should I be checking in generated files? 
**** I'm also fine with putting people on the contributor list

** announcements 
*** lambert lum is looking for raku speakers for svperl on Jan 5, 2023

*** November 6th: the next raku study group meeting

